rails-bootstrap/app/controllers/purchase_batches_controller.rb

INSERT INTO "purchase_batches" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 01 Apr 2014 17:16:22 UTC +00:00], ["updated_at", Tue, 01 Apr 2014 17:16:22 UTC +00:00]]
INSERT INTO "purchases" ("created_at", "purchase_batch_id", "purchaser_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 01 Apr 2014 17:16:22 UTC +00:00], ["purchase_batch_id", 1], ["purchaser_id", 1], ["updated_at", Tue, 01 Apr 2014 17:16:22 UTC +00:00]]
---
  def create
    file = params[:purchase_batch][:file]
    @purchase_batch = PurchaseBatch.create_from_file(file.tempfile)

SELECT "purchase_batches".* FROM "purchase_batches" WHERE "purchase_batches"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_purchase_batch
      @purchase_batch = PurchaseBatch.find(params[:id])